Repository: Afaneor/fastapi-docker-boilerplate
Catalog: {{cookiecutter.project_name}}/app/locales/*/LC_MESSAGES/messages.po
Languages: ru

source: bar
ru: бар

source: Invalid JSON: {}
ru: Неверный JSON: {}

source: JSON input should be string, bytes or bytearray
ru: JSON должен быть строкой, байтами или массивом байтов

source: Recursion error - cyclic reference detected
ru: Ошибка рекурсии - обнаружена циклическая ссылка

source: Field required
ru: Обязательное поле

source: Field is frozen
ru: Поле не может быть изменено (frozen)

source: Instance is frozen
ru: Экземпляр не может быть изменен (frozen)

source: Extra inputs are not permitted
ru: Дополнительные входные данные не разрешены

source: Keys should be strings
ru: Ключи должны быть строками

source: Error extracting attribute: {}
ru: Ошибка при извлечении атрибута: {}

source: Input should be a valid dictionary or instance of {}
ru: Входные данные должны быть словарем или экземпляром {}

source: Input should be a valid dictionary or object to extract fields from
ru: Входные данные должны быть словарем или объектом для извлечения полей

source: Input should be a dictionary or an instance of {}
ru: Входные данные должны быть словарем или экземпляром {}

source: Input should be an instance of {}
ru: Входные данные должны быть экземпляром {}

source: Input should be None
ru: Входные данные должны быть None

source: Input should be greater than {}
ru: Значение должно быть больше {}

source: Input should be greater than or equal to {}
ru: Значение должно быть больше или равно {}

source: Input should be less than {}
ru: Значение должно быть меньше {}

source: Input should be less than or equal to {}
ru: Значение должно быть меньше или равно {}

source: Input should be a multiple of {}
ru: Значение должно быть кратным {}

source: Input should be a finite number
ru: Значение должно быть конечным числом

source: Input should be iterable
ru: Значение должно быть итерируемым

source: Error iterating over object, error: {}
ru: Ошибка при итерации по объекту: {}

source: Input should be a valid string
ru: Значение должно быть допустимой строкой

source: Input should be a string, not an instance of a subclass of str
ru: Значение должно быть строкой, а не экземпляром подкласса str

source: Input should be a valid string, unable to parse raw data as a unicode string
ru: Значение должно быть допустимой строкой, невозможно разобрать данные как unicode строку

source: String should have at least {}
ru: Строка должна содержать не менее {}

source: String should have at most {}
ru: Строка должна содержать не более {}

source: String should match pattern '{}'
ru: Строка должна соответствовать шаблону '{}'

source: Input should be {}
ru: Значение должно быть {}

source: Input should be a valid dictionary
ru: Значение должно быть допустимым словарем

source: Input should be a valid mapping, error: {}
ru: Значение должно быть допустимым отображением, ошибка: {}

source: Input should be a valid list
ru: Значение должно быть допустимым списком

source: Input should be a valid tuple
ru: Значение должно быть допустимым кортежем

source: Input should be a valid set
ru: Значение должно быть допустимым множеством

source: Input should be a valid boolean
ru: Значение должно быть логическим (boolean)

source: Input should be a valid boolean, unable to interpret input
ru: Значение должно быть логическим (boolean), невозможно интерпретировать входные данные

source: Input should be a valid integer
ru: Значение должно быть целым числом

source: Input should be a valid integer, unable to parse string as an integer
ru: Значение должно быть целым числом, невозможно преобразовать строку в целое число

source: Unable to parse input string as an integer, exceeded maximum size
ru: Невозможно преобразовать строку в целое число, превышен максимальный размер

source: Input should be a valid integer, got a number with a fractional part
ru: Значение должно быть целым числом, получено число с дробной частью

source: Input should be a valid number
ru: Значение должно быть числом

source: Input should be a valid number, unable to parse string as a number
ru: Значение должно быть числом, невозможно преобразовать строку в число

source: Input should be a valid bytes
ru: Значение должно быть допустимыми байтами

source: Data should have at least {}
ru: Данные должны содержать не менее {}

source: Data should have at most {}
ru: Данные должны содержать не более {}

source: Data should be valid {}
ru: Данные должны быть допустимыми {}

source: Value error, {}
ru: Ошибка значения, {}

source: Assertion failed, {}
ru: Проверка не пройдена, {}

source: Input should be a valid date
ru: Значение должно быть допустимой датой

source: Input should be a valid date in the format YYYY-MM-DD, {}
ru: Значение должно быть допустимой датой в формате ГГГГ-ММ-ДД, {}

source: Input should be a valid date or datetime, {}
ru: Значение должно быть допустимой датой или датой-временем, {}

source: Datetimes provided to dates should have zero time - e.g. be exact dates
ru: Дата-время для дат должна иметь нулевое время - т.е. быть точными датами

source: Date should be in the past
ru: Дата должна быть в прошлом

source: Date should be in the future
ru: Дата должна быть в будущем

source: Input should be a valid time
ru: Значение должно быть допустимым временем

source: Input should be in a valid time format, {}
ru: Значение должно быть в допустимом формате времени, {}

source: Input should be a valid datetime
ru: Значение должно быть допустимой датой-временем

source: Input should be a valid datetime, {}
ru: Значение должно быть допустимой датой-временем, {}

source: Invalid datetime object, got {}
ru: Недопустимый объект даты-времени, получено {}

source: Input should be a valid datetime or date, {}
ru: Значение должно быть допустимой датой-временем или датой, {}

source: Input should be in the past
ru: Значение должно быть в прошлом

source: Input should be in the future
ru: Значение должно быть в будущем

source: Input should not have timezone info
ru: Значение не должно содержать информацию о часовом поясе

source: Input should have timezone info
ru: Значение должно содержать информацию о часовом поясе

source: Timezone offset of {}
ru: Смещение часового пояса {}

source: Input should be a valid timedelta
ru: Значение должно быть допустимым интервалом времени

source: Input should be a valid timedelta, {}
ru: Значение должно быть допустимым интервалом времени, {}

source: Input should be a valid frozenset
ru: Значение должно быть допустимым frozenset

source: Input should be a subclass of {}
ru: Значение должно быть подклассом {}

source: Input should be callable
ru: Значение должно быть вызываемым

source: Input tag '{}
ru: Входной тег '{}

source: Unable to extract tag using discriminator {}
ru: Невозможно извлечь тег, используя дискриминатор {}

source: Arguments must be a tuple, list or a dictionary
ru: Аргументы должны быть кортежем, списком или словарем

source: Missing required argument
ru: Отсутствует обязательный аргумент

source: Unexpected keyword argument
ru: Неожиданный именованный аргумент

source: Missing required keyword only argument
ru: Отсутствует обязательный именованный аргумент

source: Unexpected positional argument
ru: Неожиданный позиционный аргумент

source: Missing required positional only argument
ru: Отсутствует обязательный позиционный аргумент

source: Got multiple values for argument
ru: Получено несколько значений для аргумента

source: URL input should be a string or URL
ru: URL должен быть строкой или объектом URL

source: Input should be a valid URL, {}
ru: Значение должно быть допустимым URL, {}

source: Input violated strict URL syntax rules, {}
ru: Значение нарушает строгие правила синтаксиса URL, {}

source: URL should have at most {}
ru: URL должен содержать не более {}

source: URL scheme should be {}
ru: Схема URL должна быть {}

source: UUID input should be a string, bytes or UUID object
ru: UUID должен быть строкой, байтами или объектом UUID

source: Input should be a valid UUID, {}
ru: Значение должно быть допустимым UUID, {}

source: UUID version {} expected
ru: Ожидается UUID версии {}

source: Decimal input should be an integer, float, string or Decimal object
ru: Десятичное число должно быть целым числом, числом с плавающей точкой, строкой или объектом Decimal

source: Input should be a valid decimal
ru: Значение должно быть допустимым десятичным числом

source: Decimal input should have no more than {} in total
ru: Десятичное число должно содержать не более {} цифр всего

source: Decimal input should have no more than {}
ru: Десятичное число должно содержать не более {}

source: Decimal input should have no more than {} before the decimal point
ru: Десятичное число должно содержать не более {} цифр до десятичной точки

source: Input should be a valid python complex object, a number, or a valid complex string following the rules at https://docs.python.org/3/library/functions.html#complex
ru: Значение должно быть допустимым комплексным объектом Python, числом или допустимой строкой комплексного числа согласно правилам https://docs.python.org/3/library/functions.html#complex

source: Input should be a valid complex string following the rules at https://docs.python.org/3/library/functions.html#complex
ru: Значение должно быть допустимой строкой комплексного числа согласно правилам https://docs.python.org/3/library/functions.html#complex
